#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api.platform_app_backend_api will be created
  + resource "azurerm_api_management_api" "platform_app_backend_api" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Platform app-backend API"
      + display_name          = "Platform app-backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-app-backend-platform-api"
      + path                  = (known after apply)
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.2
                info:
                  title: Public API & Trial System API
                  description: Mobile and web backend API by platform.
                  version: 16.14.0
                servers:
                  - url: https://localhost/
                paths:
                  /:
                    get:
                      summary: Redirect
                      description: |
                        Redirects to a specific URL.
                      operationId: Redirect
                      responses:
                        '302':
                          description: HTTP Redirect.
                          headers:
                            Location:
                              description: URL where the client is being redirected.
                              schema:
                                type: string
                          content: {}
                    x-swagger-router-controller: ServerInfoController
                  /info:
                    get:
                      summary: Runtime server info
                      description: |
                        Returns runtime information about the server.
                      operationId: getServerInfo
                      responses:
                        '200':
                          description: Runtime server info.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ServerInfo'
                              example:
                                version: 0.0.1
                                min_app_version: 0.0.0
                                min_app_version_pagopa: 0.0.0
                    x-swagger-router-controller: ServerInfoController
                  /api/v1/ping:
                    get:
                      summary: Check online status
                      description: |
                        Returns no content.
                      operationId: getPing
                      responses:
                        '204':
                          description: Service is alive.
                          content: {}
                    x-swagger-router-controller: StatusServicesController
                  /api/v1/status:
                    get:
                      summary: Get service statuses
                      description: Returns the current status of all microservices.
                      operationId: getServicesStatus
                      responses:
                        '200':
                          description: App backend microservices statuses.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ServicesStatus'
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                    x-swagger-router-controller: StatusServicesController
                  /api/v1/trials/{trialId}/subscriptions:
                    get:
                      summary: Get subscription detail
                      description: >-
                        Returns the details about the subscription of the authenticated user for
                        the specified trial.
                      operationId: getSubscription
                      parameters:
                        - name: trialId
                          in: path
                          required: true
                          schema:
                            minLength: 1
                            type: string
                      responses:
                        '200':
                          description: Success.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Subscription'
                        '401':
                          description: Authorization error.
                          content: {}
                        '404':
                          description: >
                            Not Found. This occurs when the specified user is not listed under
                            the trial.
                          content: {}
                        '429':
                          description: Too may requests.
                          content: {}
                        '500':
                          description: There was an error.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                    post:
                      summary: Create a subscription
                      description: Subscribe the authenticated user to the given trial.
                      operationId: createSubscription
                      parameters:
                        - name: trialId
                          in: path
                          required: true
                          schema:
                            minLength: 1
                            type: string
                      responses:
                        '201':
                          description: >
                            Created: the request has been processed and the user has been
                            registered for the trial.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Subscription'
                        '202':
                          description: >
                            Accepted: the request has been received, but the user may not yet be
                            subscribed to the trial.
                
                            The server will process the request asynchronously.
                
                            Resubmitting the same request may result in a `409 Conflict` error.
                          content: {}
                        '400':
                          description: Validation error.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '401':
                          description: Authorization error.
                          content: {}
                        '409':
                          description: The resource already exists.
                          content: {}
                        '429':
                          description: Too may requests.
                          content: {}
                        '500':
                          description: There was an error.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                components:
                  schemas:
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: >-
                            A short, summary of the problem type. Written in english and
                            readable
                
                            for engineers (usually not suited for non technical stakeholders and
                
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
                    CreatedAt:
                      type: string
                      format: UTCISODateFromString
                      description: A date-time field in ISO-8601 format and UTC timezone.
                      x-import: '@pagopa/ts-commons/lib/dates'
                      example: '2018-10-13T00:00:00.000Z'
                    ServerInfo:
                      title: Server information
                      required:
                        - min_app_version
                        - min_app_version_pagopa
                        - version
                      type: object
                      properties:
                        version:
                          type: string
                        min_app_version:
                          $ref: '#/components/schemas/VersionPerPlatform'
                        min_app_version_pagopa:
                          $ref: '#/components/schemas/VersionPerPlatform'
                    VersionPerPlatform:
                      title: Specify a version for ios and another for android
                      required:
                        - android
                        - ios
                      type: object
                      properties:
                        ios:
                          type: string
                        android:
                          type: string
                    ServicesStatus:
                      required:
                        - services
                      type: object
                      properties:
                        services:
                          type: array
                          items:
                            $ref: '#/components/schemas/ServiceStatus'
                    ServiceStatus:
                      required:
                        - details
                        - id
                        - status
                      type: object
                      properties:
                        id:
                          type: string
                        status:
                          $ref: '#/components/schemas/StatusEnum'
                        details:
                          type: string
                    StatusEnum:
                      type: string
                      description: Status of a service
                      enum:
                        - OK
                        - WARNING
                        - CRITICAL
                        - PARTIAL_AVAILABILITY
                        - MANTAINANCE
                    SubscriptionState:
                      type: string
                      description: >-
                        - UNSUBSCRIBED: The user is not subscribed to the specified trial and
                        does
                            not have any access to the specified trial.
                        - SUBSCRIBED: The user is subscribed to the specified trial and does
                            not have any access to the specified trial. The system is going to
                            activate the user if any slot for the trial is available.
                        - ACTIVE: The user has the access to the specified trial.
                
                        - DISABLED: The user does not have the access to the specified trial.
                
                
                        When a user subscribes a trial, the subscription is in the `SUBSCRIBED`
                        state
                
                        If the user wants to unsubscribe, the state changes to `UNSUBSCRIBED`.
                
                        When the trial is going to be activated (by the Trial Manager, the owner
                        of the trial), then the state of the
                
                        selected `SUBSCRIBED` users becomes `ACTIVE`.
                
                        The Trial Manager can change the state of any user, within its own
                        subscription,
                
                        to any state (e.g. can disable a subscription setting the state to
                        `DISABLED`).
                      enum:
                        - UNSUBSCRIBED
                        - SUBSCRIBED
                        - ACTIVE
                        - DISABLED
                    TrialId:
                      minLength: 1
                      type: string
                      description: Unique identifier of the trial.
                    Subscription:
                      required:
                        - createdAt
                        - state
                        - trialId
                      type: object
                      properties:
                        trialId:
                          $ref: '#/components/schemas/TrialId'
                        state:
                          $ref: '#/components/schemas/SubscriptionState'
                        createdAt:
                          $ref: '#/components/schemas/CreatedAt'
                  parameters:
                    pathTrialId:
                      name: trialId
                      in: path
                      required: true
                      schema:
                        minLength: 1
                        type: string
                  securitySchemes:
                    Bearer:
                      type: apiKey
                      name: Authorization
                      in: header
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_operation_policy.get_services_status_operation_policy will be created
  + resource "azurerm_api_management_api_operation_policy" "get_services_status_operation_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-app-backend-platform-api"
      + id                  = (known after apply)
      + operation_id        = "getServicesStatus"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_policy.platform_app_backend_api_policy will be created
  + resource "azurerm_api_management_api_policy" "platform_app_backend_api_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-app-backend-platform-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                    <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
                    <set-variable name="urlId" value="@{
                        Random rnd = new Random();
                        int urlId = rnd.Next(1, 3);
                        return urlId.ToString();
                    }" />
                    <choose>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
                        </when>
                        <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
                            <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
                        </when>
                        <otherwise>
                            <return-response>
                                <set-status code="500" reason="InternalServerError" />
                                <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
                                    <value>@{return Guid.NewGuid().ToString();}</value>
                                </set-header>
                                <set-body>A gateway-related error occurred while processing the request.</set-body>
                            </return-response>
                        </otherwise>
                    </choose>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_group.platform_apim_group will be created
  + resource "azurerm_api_management_group" "platform_apim_group" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + description         = "Owners of io-platform product with management rights"
      + display_name        = "Platform APIM Product Owners"
      + external_id         = "aad://a0ed72be-f9f9-407e-bf25-91761f8d3de7"
      + id                  = (known after apply)
      + name                = "platform"
      + resource_group_name = "io-p-itn-common-rg-01"
      + type                = "external"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product.platform_apim_product will be created
  + resource "azurerm_api_management_product" "platform_apim_product" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO Platform APIs"
      + display_name          = "IO PLATFORM"
      + id                    = (known after apply)
      + product_id            = "io-platform"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_api.platform_api_product_link will be created
  + resource "azurerm_api_management_product_api" "platform_api_product_link" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-app-backend-platform-api"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_group.platform_apim_product_group will be created
  + resource "azurerm_api_management_product_group" "platform_apim_product_group" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + group_name          = "platform"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_product_policy.platform_apim_product_policy will be created
  + resource "azurerm_api_management_product_policy" "platform_apim_product_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-platform"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
      ~ public_network_access_enabled = true -> false
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.1.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (20 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (11 unchanged attributes hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/platform_api_gateway/api_platform.tf line 59, in resource "azurerm_api_management_api" "platform_app_backend_api":
  59:     content_value  = data.http.platform_app_backend_openapi.body

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.assets_cdn_weu.module.assets_cdn.azurerm_storage_account.this,
  on .terraform/modules/assets_cdn_weu.assets_cdn/storage_account/main.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

(and 18 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
